status_mapping = {
    'נקלט': 'ממתין',
    'טופל': 'בוצע',
}

excel2_mapping = {
    'וסט קרמי': ['וסטים קרמים'],
    'חלפ"ס': ['חליפת סערה'],
    'פנסי ראש': ['פנס ראש'],
    'משקפי מגן לירי': ['משקפי ירי'],
    'מסיכות לפנים': ['מסכת פנים - טקטית'],
    'ביגוד תרמי ( חולצה + מכנס )': ['חולצה טרמית', 'מכנס טרמי'],
    'מטען נייד + ראש הטענה': ['מטען נייד', 'ראש הטענה'],
    'פליזים': ['פליז עליון', 'פליז תחתון'],
}

weapons_mapping = {
    'כיסוי שעון רוחב 40 ס"מ - יש לצייו כמות': 'כיסוי שעון  40 סממ',
    'כיסוי שעון רוחב 50 ס"מ ': 'כיסוי שעון 50 סמ',
    "חגורה סקוץ' שחור ": 'חגורת סקוצ׳',
    'רצועה למאג': 'רצועה לנשק',
    'פק"ל ירך מולי': 'פקל ירך',
    'מצנפת קסדה ': 'מצנפת קסדה',
}

sew_mapping = {
    # תיק לאו
    'תיק לאו ': 'תיקי לאו',

    #תיקי שורש
    'שקית שורש': 'תיקי שורש',

    # פונדה למחסנית לווסט
    'פונדה לווסט': 'פונדה למחסנית לווסט',

    # פונדה למחסנית לאקדח
    'פונדה לאקדח': 'פונדה למחסנית לאקדח',

    # פאוץ רימון
    'פאוצ לרימון מטול (מקום ל 5/6)': 'פאוץ רימון',
    'פאוץ רימון לאפוד מודולרי טרור 4 יח': 'פאוץ רימון',
    " פאוצ' חובש מודולרי": 'פאוץ חובש',

    # רצועה לנשק
    'רצועה שחורה לנשק': 'רצועה לנשק',
    'רתועה לנשק': 'רצועה לנשק',
    '*רצועות איכותיות לנשק': 'רצועה לנשק',
    '3 רצועות לנשק (הכי פשוטות שיש לא דחוף)': 'רצועה לנשק',
    'רצועה לנשק': 'רצועה לנשק',
    'רצועות לנשק': 'רצועה לנשק',

    # נרתיק ירך לאקדח
    'נרתיקי ירך לאקדח': 'נרתיק ירך לאקדח',

    # נרתיק ירך לגלוק 17/19
    'פקל ירך לגלוק 19- יד ימין': 'נרתיק ירך לגלוק 17/19',

    # כיסויי שעון
    'כיסוי שעון 50 סמ / 40 סממ': ['כיסוי שעון 50 סמ', 'כיסוי שעון  40 סממ'],
    'כיסוי לשעון ': ['כיסוי שעון 50 סמ', 'כיסוי שעון  40 סממ'],
    'כיסוי שעון': ['כיסוי שעון 50 סמ', 'כיסוי שעון  40 סממ'],
    ' כיסוי שעון': ['כיסוי שעון 50 סמ', 'כיסוי שעון  40 סממ'],
    'כיסויי שעו': ['כיסוי שעון 50 סמ', 'כיסוי שעון  40 סממ'],
    'כיסויי שעון': ['כיסוי שעון 50 סמ', 'כיסוי שעון  40 סממ'],
    '10 כיסויי שעון': ['כיסוי שעון 50 סמ', 'כיסוי שעון  40 סממ'],
    '16 כיסויי שעון לג׳י שוק': ['כיסוי שעון 50 סמ', 'כיסוי שעון  40 סממ'],
    'כיסוי שעון G SHOCK': ['כיסוי שעון 50 סמ', 'כיסוי שעון  40 סממ'],
    'כיסוי לשעון': ['כיסוי שעון 50 סמ', 'כיסוי שעון  40 סממ'],

    # כיסוי שעון 50 סמ
    'שעון 50': 'כיסוי שעון 50 סמ',
    'כיסוי שעון 50 סמ ': 'כיסוי שעון 50 סמ',
    'כיסוי שעון 50 סמ': 'כיסוי שעון 50 סמ',
    'כסויי שעון 50 ממ': 'כיסוי שעון 50 סמ',
    'כיסוי שעון 50 - 20': 'כיסוי שעון 50 סמ',
    'כיסוי שעון50': 'כיסוי שעון 50 סמ',
    'כיסוי שעון 50': 'כיסוי שעון 50 סמ',
    'כיסוי לשעון 50': 'כיסוי שעון 50 סמ',
    'כיסוי שעון 50 ס"מ 16 יחידות': 'כיסוי שעון 50 סמ',
    '*כיסויי שעונים 50 מילימטר': 'כיסוי שעון 50 סמ',
    'כיסויי שעון 50 ס״מ': 'כיסוי שעון 50 סמ',
    'כיסוי שעון 50 מילימטר 20 יחידות': 'כיסוי שעון 50 סמ',

    # כיסוי שעון  40 סממ
    'כיסוי שעון 40. 3 יחי': 'כיסוי שעון  40 סממ',
    'כיסוי שעון 40 - 20': 'כיסוי שעון  40 סממ',
    'שעון 40': 'כיסוי שעון  40 סממ',
    'כיסויי שעון 40': 'כיסוי שעון  40 סממ',
    'כיסוי לשעון רוחב 40 ': 'כיסוי שעון  40 סממ',
    'כיסוי שעון  40': 'כיסוי שעון  40 סממ',
    'כיסוי שעון 40': 'כיסוי שעון  40 סממ',
    'כיסוי שעון  40 מ"מ  ': 'כיסוי שעון  40 סממ',
    'כיסוי שעון 40 סמ - 20 יח׳': 'כיסוי שעון  40 סממ',

    # מצנפת קסדה
    'מצנפת קסדה 3 יחי': 'מצנפת קסדה',
    '20 מצנפת קסדה': 'מצנפת קסדה',
    '2 מצנפות': 'מצנפת קסדה',
    'מצנפת לקסדה': 'מצנפת קסדה',
    'מצנפת קסדה': 'מצנפת קסדה',
    ' מצנפות': 'מצנפת קסדה',
    'מצנפת': 'מצנפת קסדה',
    'מצנפת ': 'מצנפת קסדה',
    'מצנפות': 'מצנפת קסדה',
    '*מצנפות': 'מצנפת קסדה',

    # חגורת סקוצ׳
    '5 חגורות סקוץ': 'חגורת סקוצ׳',
    "חגורת סקוץ שחור 20 יחידות": 'חגורת סקוצ׳',
    'חגורות סקוצ\'': 'חגורת סקוצ׳',
    "חגורת סקוץ' שחור": 'חגורת סקוצ׳',
    'חגורת סקוץ (לא קטנות מדי,  xl xxl)': 'חגורת סקוצ׳',
    'חגורת סקוץ 40': 'חגורת סקוצ׳',
    'חגורות סקוטש שחור': 'חגורת סקוצ׳',
    'חגורות סקוץ': 'חגורת סקוצ׳',
    'חגורת סקוצ': 'חגורת סקוצ׳',
    '20 יחידות חגורת סקוץ': 'חגורת סקוצ׳',
    "חגורות סקוץ'": 'חגורת סקוצ׳',
    "חגורת סקוצ'": 'חגורת סקוצ׳',
    'חגורת סקוץ': 'חגורת סקוצ׳',
    ' חגורות סקוץ': 'חגורת סקוצ׳',
    "5 חגורות סקוטצ' קצרות": 'חגורת סקוצ׳',
    "חגורות סקוצ": 'חגורת סקוצ׳',
    'חגורת סקוטש': 'חגורת סקוצ׳',
    "חגורות סקוץ' שחור  ": 'חגורת סקוצ׳',
    "חגורות סקוץ שחורות ": 'חגורת סקוצ׳',
    'חגורת סקוץ שחורה': 'חגורת סקוצ׳',
    '16 חגורות סקוץ׳': 'חגורת סקוצ׳',
    "20 חגורות סקוצ'": 'חגורת סקוצ׳',
    "חגורה סקוץ": 'חגורת סקוצ׳',
    " חגורת סקוטש": 'חגורת סקוצ׳',
    "חגורת סקוץ'": 'חגורת סקוצ׳',
    "חגורת סקוץ M-L": 'חגורת סקוצ׳',
    'חגורת סקוצ׳ שחור - 20 יח׳': 'חגורת סקוצ׳',
    'חגורת סקוץ\' 16 יחידות': 'חגורת סקוצ׳',

    # פקל ירך
    'פק״לי ירך': 'פקל ירך',
    'פקל ירך למפקד/חוליית חבלה': 'פקל ירך',
    '2 פקלי ירך למפקדים': 'פקל ירך',
    ' פקלי ירך למפקדים': 'פקל ירך',
    'פקל ירך מפקד': 'פקל ירך',
    'פק"ל ירך מולי ': 'פקל ירך',
    'פק"ל ירך מולי. 5 יחי': 'פקל ירך',
    'פקל ירך 8 יחידות': 'פקל ירך',
    'פקל ירך 20': 'פקל ירך',
    'פק"ל ירך למטול ': 'פקל ירך',
    'פקלי ירך לאקדח': 'פקל ירך',
    'פקל ירך פצטולים': 'פקל ירך',
    'פקל ירך לפצטולים': 'פקל ירך',
    'פקל פחצולים': 'פקל ירך',
    'פקל ירך מטול נפיץ': 'פקל ירך',
    'פקל ירך אקדח': 'פקל ירך',
    'פקל ירך 6 יחידות': 'פקל ירך',
    'פק ל ירך': 'פקל ירך',
    'פקל יקך': 'פקל ירך',
    ' פקלי ירך': 'פקל ירך',
    'פקל ירך שחור': 'פקל ירך',
    'פקל ירך לזיג אוויר P365': 'פקל ירך',
    'פקל  ירך לאקדח (גלוק 17-19) מקום למחסנית': 'פקל ירך',
    'פקל ירך חובשים ': 'פקל ירך',
    'פקל ירך לשמאל גלוק X43': 'פקל ירך',
    'פקל ירך ל 6 פצטולים': 'פקל ירך',
    'פקל ירך ? ': 'פקל ירך',
    'ופק״ל ירך': 'פקל ירך',
    '6 פק"ל ירך': 'פקל ירך',
    '5 פקל ירך': 'פקל ירך',
    '4 פק״לי ירך': 'פקל ירך',
    'פקל ירך 4 יח': 'פקל ירך',
    'פקליי ירך 12': 'פקל ירך',
    'פקלי ירך': 'פקל ירך',
    '10 פקלי ירך ו': 'פקל ירך',
    'פקל ירך ': 'פקל ירך',
    'פקל  ירך': 'פקל ירך',
    'פקל ירך': 'פקל ירך',
    '  פקל ירך': 'פקל ירך',
    'פקח ירך ': 'פקל ירך',
    'פקל ירך כיסים בלבד': 'פקל ירך',
    'פק"ל ירך': 'פקל ירך',
    ' פקל ירך': 'פקל ירך',
    'פקל ירך מטול': 'פקל ירך',
    'פקל ירך למטול': 'פקל ירך',
    'פקל ירך לאקדח': 'פקל ירך',
    '  פקל ירך לאקדח': 'פקל ירך',
    'פקל ירך מולי - 10 יחידות': 'פקל ירך',
    'פקל מולי': 'פקל ירך',
    'פקל ירך מולי': 'פקל ירך',
    'פקל ירך מפקד (למפות וכדומה)': 'פקל ירך',
    'פקח ירך לאקדח': 'פקל ירך',
    'פקך ירך': 'פקל ירך',
    'פק"ל ירך מולי': 'פקל ירך',
    ' פק"לי ירך לחובשים': 'פקל ירך',
    'פקל ירך למטול נפיץ': 'פקל ירך',
    '2 פקל ירך שמאלי לאקדח': 'פקל ירך',
    '6 פקלי ירך לאקדח': 'פקל ירך',
}

